Repository: Vistaus/Echo
Catalog: po/*.po
Languages: ar, nb

source: Ping Utility
ar: أداة أختبار الاتصال
nb: Ekkoforespørsel

source: Ping websites
ar: اختبار الاتصال بمواقع إلكترونية
nb: Ta tempen på nettsteder

source: ping
ar: أختبار الاتصال
nb: ping;ekkoforespørsel;nettsteder;nettverk;

source: Utility to ping websites.
ar: أداة لاختبار الاتصال بموقع إلكتروني.
nb: Echo lar deg sende forespørsler til nettjenere og beregne hvor lang tid det tar å få svar.

source: Features include:
ar: تتضمن الميزات ما يلي:
nb: Fordeler med Echo inkluderer:

source: Advanced ping parameters like ping count, timeout, etc
ar: معلمات متقدمة لاختبار الاتصال مثل عدد الحزم، مهلة الاستجابة، وغيرها
nb: Avanserte innstillinger som makstid og antall forespørsler

source: Main page showcasing the ping form with advanced options
ar: الصفحة الرئيسية تعرض نموذج اختبار الاتصال مع خيارات متقدمة
nb: Hovedvindu med avanserte innstillinger

source: Ping results page showcasing the stats after the ping
ar: صفحة نتائج اختبار الاتصال تعرض الإحصائيات بعد إجراء الاختبار
nb: Resultatside

source: translator-credits
ar: Ronnie Nissan <ronnie.nissan@proton.me>

source: Cancelling Ping
ar: إلغاء أختبار الاتصال
nb: Avbryter

source: Ping Failed
ar: فشل أختبار الاتصال

source: Ping Succeed
ar: نجح أختبار الاتصال

source: The host can't be resolved or doesn't exist
ar: لا يمكن حل اسم المضيف أو أنه غير موجود.
nb: Adressen eksisterer ikke

source: Insufficient permissions
ar: صلاحيات غير كافية
nb: Nødvendige tillatelser mangler

source: Host timeout
ar: انتهاء مهلة أستجابة المضيف
nb: Tidsgrense nådd

source: Destination is unreachable
ar: لا يمكن الوصول إلى الوجهة
nb: Destinasjonen er utilgjengelig

source: Unexpected error
ar: خطء غير متوقع
nb: Ukjent feil

source: Details
ar: التفاصيل
nb: Informasjon

source: Cancel Ping
ar: قم بإلغاء أختبار الاتصال
nb: Avbryt

source: About Echo
ar: حول Echo
nb: Om Echo

source: No network connection
ar: لا يوجد اتصال بالشبكة
nb: Ikke på nett

source: Address
ar: العناوين
nb: Adresse

source: Ping Options
ar: أختيارات أختبار الاتصال
nb: Innstillinger

source: Count
ar: العدد
nb: Antall

source: Number of pings to perform
ar: عدد أختبارات الاتصال المطلوب تنفيذها
nb: Antall forespørsler som skal sendes

source: Interval
ar: الفاصل الزمني
nb: Intervall

source: Seconds between sending each packet
ar: عدد الثواني بين إرسال كل حزمة بيانات
nb: Sekunder mellom hver forespørsel

source: Timeout
ar: أنتهاء مهلة الاستجابة
nb: Tidsgrense

source: Maximum seconds to wait for a reply
ar: أقصى عدد من الثواني للانتظار للحصول على رد
nb: Sekunder før forespørslene avbrytes uten svar

source: Source
ar: المصدر
nb: Kilde

source: Info
ar: المعلومات
nb: Informasjon

source: The IP address from which to ping
ar: عنوان IP الذي سيتم إجراء اختبار الاتصال منه
nb: IP-adressen forespørselen skal sendes fra

source: Family
ar: العائلة
nb: Protokoll

source: The version of the Internet Protocol
ar: إصدار بروتوكول الإنترنت
nb: IP-versjonen som skal brukes

source: Ping
ar: أختبار الاتصال
nb: Send

source: Minimum
ar: الحد الأدنى

source: Average
ar: المعدل

source: Maximum
ar: الحد الأقصى

source: Ping Results
ar: نتائج أختبار الاتصال
nb: Resultater

source: Response Time
ar: وقت الاستجابة
nb: Svartid

source: Packets Sent
ar: حزمات البيانات المرسلة
nb: Forespørsler

source: Packets Received
ar: حزمات البيانات المستلمة
nb: Svar

source: Packet Loss
ar: فقدان الحزمة
nb: Mislykket

# shortcut window
source: General
ar: عام
nb: Generelt

# shortcut window
source: Show Shortcuts
ar: أظهار الاختصارات
nb: Vis tastatursnarveier

# shortcut window
source: Quit
ar: الخروج
nb: Avslutt
